
//ВКМ_В обработчик добавлена процедура вывода элементов на форму
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
			
		//Создаем группу для периода и добавляем туда элементы периода
		ГруппаПериод = Элементы.Добавить("ГруппаОбычная", Тип("ГруппаФормы"));
		ГруппаПериод.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаПериод.ОтображатьЗаголовок = Ложь;
		ГруппаПериод.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
		НовыйЭлемент = Элементы.Добавить("ВКМ_ДействуетС", Тип("ПолеФормы"), ГруппаПериод);
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДействуетС";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			
		НовыйЭлемент = Элементы.Добавить("ВКМ_ДействуетПо", Тип("ПолеФормы"), ГруппаПериод);
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДействуетПо";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		////////////////////////////////////////////////////////
		
		//Создаем элементы АбонентскаяПлата и СтомостьЧасаРаботы
		
		НовыйЭлемент = Элементы.Добавить("ВКМ_АбонентскаяПлата", Тип("ПолеФормы"));
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_АбонентскаяПлата";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		
		НовыйЭлемент = Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"));
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		////////////////////////////////////////////////////////  
КонецПроцедуры 
////////////////////////////////////////////////////////

//ВКМ_В обработчик добавлена процедура вывода элементов на форму
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    ИзменитьВидимостьРеквизитов();

КонецПроцедуры
////////////////////////////////////////////////////////

//ВКМ_В обработчик добавлена процедура вывода элементов на форму
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент) 
	
	ИзменитьВидимостьРеквизитов();
	
КонецПроцедуры
//////////////////////////////////////////////////////// 

//ВКМ_Обработчик видимости элементов формы по типу договора
&НаКлиенте
Процедура ИзменитьВидимостьРеквизитов() 
	
	//Если ВидДоговора - абонентский, тогда делаем видимыми	реквизиты абонентского договора
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда 
		
		ЭтаФорма.Элементы.ГруппаОбычная.Видимость = Истина;
		ЭтаФорма.Элементы.ВКМ_АбонентскаяПлата.Видимость = Истина;
		ЭтаФорма.Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина;	
		
	//Иначе мы скрываем созданные элементы
	ИначеЕсли Объект.ВидДоговора <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда 
		
		ЭтаФорма.Элементы.ГруппаОбычная.Видимость = Ложь;
		ЭтаФорма.Элементы.ВКМ_АбонентскаяПлата.Видимость = Ложь;
		ЭтаФорма.Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь;
	
	КонецЕсли;
	
КонецПроцедуры
////////////////////////////////////////////////////////





