//ВКМ_В обработчик добавлена процедура вывода элементов на форму
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры
////////////////////////////////////////////////////////

//ВКМ_В обработчик добавлена процедура вывода элементов на форму
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры 
////////////////////////////////////////////////////////

//ВКМ_Вывод элементов на форму при выборе ВидДоговора - АбонентскийДоговор
&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	
	//Если ВидДоговора - абонентский и рекивизиты еще не создавали тогда создаем элементы и реквизиты абонентского договора
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание И
		Элементы.Найти("ВКМ_ДействуетС") = Неопределено Тогда
		
		//Создаем группу для периода и добавляем туда элементы периода
		ГруппаПериод = Элементы.Добавить("ГруппаОбычная", Тип("ГруппаФормы"));
		ГруппаПериод.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаПериод.ОтображатьЗаголовок = Ложь;
		ГруппаПериод.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
		Если Элементы.Найти("ВКМ_ДействуетС") = Неопределено Тогда
			НовыйЭлемент = Элементы.Добавить("ВКМ_ДействуетС", Тип("ПолеФормы"), ГруппаПериод);
			НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДействуетС";
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		КонецЕсли;	
		Если Элементы.Найти("ВКМ_ДействуетПо") = Неопределено Тогда
			НовыйЭлемент = Элементы.Добавить("ВКМ_ДействуетПо", Тип("ПолеФормы"), ГруппаПериод);
			НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДействуетПо";
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		КонецЕсли;
		////////////////////////////////////////////////////////
		
		//Создаем элементы АбонентскаяПлата и СтомостьЧасаРаботы
		Если Элементы.Найти("ВКМ_АбонентскаяПлата") = Неопределено Тогда
			НовыйЭлемент = Элементы.Добавить("ВКМ_АбонентскаяПлата", Тип("ПолеФормы"));
			НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_АбонентскаяПлата";
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		КонецЕсли;
		Если Элементы.Найти("ВКМ_СтоимостьЧасаРаботы") = Неопределено Тогда
			НовыйЭлемент = Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"));
			НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		КонецЕсли;
		////////////////////////////////////////////////////////
		
	//Если ВидДоговора - абонентский и рекивизиты уже создавали, тогда делаем их видимыми	
	ИначеЕсли Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание И 
		Элементы.Найти("ВКМ_ДействуетС") <> Неопределено Тогда 
		
		ЭтаФорма.Элементы.ГруппаОбычная.Видимость = Истина;
		ЭтаФорма.Элементы.ВКМ_АбонентскаяПлата.Видимость = Истина;
		ЭтаФорма.Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина;	
		
	//При изменении вида договора мы скрываем созданные элементы
	ИначеЕсли Объект.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание И 
		Элементы.Найти("ВКМ_ДействуетС") <> Неопределено Тогда 
		
		ЭтаФорма.Элементы.ГруппаОбычная.Видимость = Ложь;
		ЭтаФорма.Элементы.ВКМ_АбонентскаяПлата.Видимость = Ложь;
		ЭтаФорма.Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь;
	
	КонецЕсли;
	
КонецПроцедуры
////////////////////////////////////////////////////////
