//ВКМ_Вывод реквизитов на форму при выборе ВидДоговора - АбонентскийДоговор
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
		
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		
		//Создаем группу для периода и добавляем туда элементы
		ГруппаПериод = Элементы.Добавить("ГруппаОбычная", Тип("ГруппаФормы"));
		ГруппаПериод.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаПериод.ОтображатьЗаголовок = Ложь;
		ГруппаПериод.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
		Если Элементы.Найти("ВКМ_ДействуетС") = Неопределено Тогда
			НовыйЭлемент = Элементы.Добавить("ВКМ_ДействуетС", Тип("ПолеФормы"), ГруппаПериод);
			НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДействуетС";
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		КонецЕсли;	
		Если Элементы.Найти("ВКМ_ДействуетПо") = Неопределено Тогда
			НовыйЭлемент = Элементы.Добавить("ВКМ_ДействуетПо", Тип("ПолеФормы"), ГруппаПериод);
			НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДействуетПо";
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		КонецЕсли;
		////////////////////////////////////////////////////////
		
		//Создаем элементы АбонентскаяПлата и СтомостьЧасаРаботы
		Если Элементы.Найти("ВКМ_АбонентскаяПлата") = Неопределено Тогда
			НовыйЭлемент = Элементы.Добавить("ВКМ_АбонентскаяПлата", Тип("ПолеФормы"));
			НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_АбонентскаяПлата";
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		КонецЕсли;
		Если Элементы.Найти("ВКМ_СтомостьЧасаРаботы") = Неопределено Тогда
			НовыйЭлемент = Элементы.Добавить("ВКМ_СтомостьЧасаРаботы", Тип("ПолеФормы"));
			НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СтомостьЧасаРаботы";
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		КонецЕсли;
		////////////////////////////////////////////////////////
		
	КонецЕсли;
	
КонецПроцедуры
//ВКМ_Вывод реквизитов на форму при выборе ВидДоговора - АбонентскийДоговор