
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Набор = РегистрыСведений.ВКМ_ГрафикОтпусков.СоздатьНаборЗаписей(); 
	
	ЧислоСекундВСутках = 86400;
	
	Для Каждого Строка Из ОтпускаСотрудников Цикл
		Счетчик = Строка.ДатаНачала;
		Пока Счетчик <= Строка.ДатаОкончания Цикл
			Запись = Набор.Добавить();
			Запись.Сотрудник = Строка.Сотрудник;
			Запись.Дата = Счетчик;
			Запись.ВыходныхДней = 1;
			Счетчик = Счетчик + ЧислоСекундВСутках;
		КонецЦикла;
	КонецЦикла;  
	
	Набор.Записать();
	
КонецПроцедуры
