Процедура ОтправитьСообщенияТелеграм() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_УведомленияТелеграмБотуДляОтправки.Ссылка КАК Ссылка,
	|	ВКМ_УведомленияТелеграмБотуДляОтправки.ТекстСообщения КАК ТекстСообщения
	|ИЗ
	|	Справочник.ВКМ_УведомленияТелеграмБотуДляОтправки КАК ВКМ_УведомленияТелеграмБотуДляОтправки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ТекстСообщения = Выборка.ТекстСообщения;
		
		HTTPСоединение = Новый HTTPСоединение("api.telegram.org", 443,,,,, Новый ЗащищенноеСоединениеOpenSSL()); 
		
		Данные = Новый Структура;
		Данные.Вставить("chat_id", Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить());
		Данные.Вставить("text", ТекстСообщения); 
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, Данные);
		СтрокаЗапроса = ЗаписьJSON.Закрыть(); 
		
		Заголовки = Новый Соответствие;
		Заголовки.Вставить("Content-Type", "application/json");
		
		HTTPЗапрос = Новый HTTPЗапрос("bot" + Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить() + "/sendMessage", Заголовки); 
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаЗапроса);
		Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		
		СообщениеОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СообщениеОбъект.Удалить();		
		
	КонецЦикла;
		
КонецПроцедуры
