
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьАктаОбОказанныхУслугах)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьАктаОбОказанныхУслугах(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура ПечатьАктаОбОказанныхУслугах(ТабДок, ПараметрКоманды)
	Документы.РеализацияТоваровУслуг.ПечатьАктаОбОказанныхУслугах(ТабДок, ПараметрКоманды);
КонецПроцедуры
