Функция СоздатьРеализацииЗаПериодВФоне(Период, Организация) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	РеализацияТоваровУслуг.Ссылка КАК Реализация
		|ПОМЕСТИТЬ ВТ_ДоговораСРеализацией
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО ДоговорыКонтрагентов.Ссылка = РеализацияТоваровУслуг.Договор
		|ГДЕ
		|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
		|	И РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	ВТ_ДоговораСРеализацией.Реализация КАК Реализация,
		|	ДоговорыКонтрагентов.Владелец КАК Контрагент
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДоговораСРеализацией КАК ВТ_ДоговораСРеализацией
		|		ПО ДоговорыКонтрагентов.Ссылка = ВТ_ДоговораСРеализацией.Договор
		|ГДЕ
		|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
		|
		|СГРУППИРОВАТЬ ПО
		|	ДоговорыКонтрагентов.Ссылка,
		|	ВТ_ДоговораСРеализацией.Реализация,
		|	ДоговорыКонтрагентов.Владелец";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Период.ДатаОкончания);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ = РезультатЗапроса.Выгрузить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	
	ТекСтрокаВыборки = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() И ТекСтрокаВыборки < ВыборкаДетальныеЗаписи.Количество() Цикл
		
		ТекСтрокаВыборки = ТекСтрокаВыборки + 1;
		
		Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Реализация) Тогда
			ДокументРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			ДокументРеализация.Дата = ТекущаяДата(); 
			ДокументРеализация.Контрагент = ВыборкаДетальныеЗаписи.Контрагент;
			ДокументРеализация.Комментарий = "Документ создан автоматической обработкой";
			ДокументРеализация.Организация = Организация;
			ДокументРеализация.Договор = ВыборкаДетальныеЗаписи.Договор;
			ДокументРеализация.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			
			//ДокументОснование = Документы.ЗаказПокупателя.СоздатьДокумент();
			//ДокументОснование.Дата = ТекущаяДата();
			//ДокументОснование.Организация = Организация;
			//ДокументОснование.Контрагент = ВыборкаДетальныеЗаписи.Контрагент;
			//ДокументОснование.Договор = ВыборкаДетальныеЗаписи.Договор;
			//ДокументОснование.Комментарий = "Документ создан автоматической обработкой";
			////ДокументОснование.ВыполнитьАвтозаполнение();
			////ДокументОснование.ПроверитьЗаполнение();
			//ДокументОснование.Записать(РежимЗаписиДокумента.Проведение);
			//
			//
			//ДокументРеализация.Основание = ДокументОснование;
			//	ДокументРеализация.Заполнить(ЭтотОбъект);
			ДокументРеализация.ВыполнитьАвтозаполнение();
			ДокументРеализация.ПроверитьЗаполнение();
			ДокументРеализация.Записать(РежимЗаписиДокумента.Проведение);  
			
		КонецЕсли;
		ДлительныеОперации.СообщитьПрогресс(ТекСтрокаВыборки/ВыборкаДетальныеЗаписи.Количество() * 100);	
	КонецЦикла;
	
	Возврат "Документы созданы!";
	
КонецФункции
