 
&НаКлиенте
Процедура ПересчитатьДниВПериоде()
	
	ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
		
	Если ЗначениеЗаполнено(ТекущиеДанные.ДатаОкончания) И ЗначениеЗаполнено(ТекущиеДанные.ДатаНачала) Тогда
	
		ТекущиеДанные.ДнейВПериоде = (НачалоДня(ТекущиеДанные.ДатаОкончания) - НачалоДня(ТекущиеДанные.ДатаНачала)) / (24*3600);
	  
	КонецЕсли; 
	
	ПересчитатьДниВГоду();
	
КонецПроцедуры 

&НаКлиенте
Процедура ПересчитатьДниВГоду() 
	
	ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные; 
	ТекущиеДанные.ВсегоЗапланированоДней = 0;
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		Если Строка.Сотрудник = ТекущиеДанные.Сотрудник Тогда	
			ТекущиеДанные.ВсегоЗапланированоДней = ТекущиеДанные.ВсегоЗапланированоДней + Строка.ДнейВПериоде;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		Если Строка.Сотрудник = ТекущиеДанные.Сотрудник Тогда	
			Строка.ВсегоЗапланированоДней = ТекущиеДанные.ВсегоЗапланированоДней;
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры 

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	ПересчитатьДниВПериоде();
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	ПересчитатьДниВПериоде();
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДнейВПериодеПриИзменении(Элемент)
	ПересчитатьДниВГоду(); 
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьАнализГрафика(Команда) 
	
	ТаблицаОтпускаСотрудников = ПоместитьДанныеВыбора();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТаблицаОтпускаСотрудников", ТаблицаОтпускаСотрудников);
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры 

&НаСервере
Функция ПоместитьДанныеВыбора() 
	
	Возврат ПоместитьВоВременноеХранилище(Объект.ОтпускаСотрудников.Выгрузить());	
	
КонецФункции  







