
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_УсловияОплатыСотрудников.Сотрудник КАК Сотрудник,
		|	МАКСИМУМ(ЕСТЬNULL(ВКМ_УсловияОплатыСотрудников.ПроцентОтРабот, 0)) КАК ПроцентОтРабот
		|ПОМЕСТИТЬ ВТ_УсловияОплатыСотрудника
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников КАК ВКМ_УсловияОплатыСотрудников
		|ГДЕ
		|	ВКМ_УсловияОплатыСотрудников.Сотрудник = &Сотрудник
		|	И ВКМ_УсловияОплатыСотрудников.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_УсловияОплатыСотрудников.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВидДоговора КАК ДоговорВидДоговора,
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_ДействуетС КАК ДействуетС,
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_ДействуетПо КАК ДействуетПо,
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_СтоимостьЧасаРаботы КАК СтомостьЧасаРаботы,
		|	ВТ_УсловияОплатыСотрудника.Сотрудник КАК Сотрудник,
		|	ВТ_УсловияОплатыСотрудника.ПроцентОтРабот КАК ПроцентОтРабот
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УсловияОплатыСотрудника КАК ВТ_УсловияОплатыСотрудника
		|		ПО ВКМ_ОбслуживаниеКлиента.Специалист = ВТ_УсловияОплатыСотрудника.Сотрудник
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка
		|	И ВКМ_ОбслуживаниеКлиента.Договор.ВидДоговора В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание))
		|	И ВКМ_ОбслуживаниеКлиента.Договор = &Договор"; 
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Сотрудник", Специалист);
	Запрос.УстановитьПараметр("Договор", Договор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ТЗ = РезультатЗапроса.Выгрузить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда	
		Выборка = РезультатЗапроса.Выбрать(); 
		Выборка.Следующий();
		
		Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
		Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
		
		Если Дата >= Выборка.ДействуетС И Дата <= Выборка.ДействуетПо Тогда	
			Для Каждого Строка Из ВыполненныеРаботы Цикл
				
				//ДВИЖЕНИЯ ДЛЯ РЕГИСТРА НАКОПЛЕНИЯ - ВКМ_ВыполненныеКлиентуРаботы	
				Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Период = Дата;
				Движение.Клиент = Клиент;
				Движение.Договор = Договор;
				Движение.КоличествоЧасов = Строка.ЧасыКОплатеКлиенту;
				Движение.СуммаКОплате = Строка.ЧасыКОплатеКлиенту * Выборка.СтомостьЧасаРаботы;		
				
				//ДВИЖЕНИЯ ДЛЯ РЕГИСТРА НАКОПЛЕНИЯ - ВКМ_ВыполненныеСотрудникомРаботы
				Если ЗначениеЗаполнено(Выборка.ПроцентОтРабот) ИЛИ Выборка.ПроцентОтРабот = 0 Тогда
					Если Выборка.ПроцентОтРабот > 0 Тогда
						Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
						Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
						Движение.Период = Дата;
						Движение.Сотрудник = Специалист;
						Движение.ЧасовКОплате = Строка.ЧасыКОплатеКлиенту;
						Движение.СуммаКОплате = Строка.ЧасыКОплатеКлиенту * Выборка.СтомостьЧасаРаботы * Выборка.ПроцентОтРабот / 100;	
					КонецЕсли;
				Иначе
					Отказ = Истина;  
					ОбщегоНазначения.СообщитьПользователю("Для сотрудника не задан процент от работ в данном периоде!");
					Возврат;	
				КонецЕсли;	
			КонецЦикла;	
		Иначе 
			Отказ = Истина;  
			ОбщегоНазначения.СообщитьПользователю("Дата документа не сооствествует периоду действия абонентского договора!");
			Возврат;	
		КонецЕсли;	
	Иначе 
		Отказ = Истина;  
		ОбщегоНазначения.СообщитьПользователю("Выбранный договор не является абонентским!");
		Возврат;		
	КонецЕсли;

КонецПроцедуры 

#КонецОбласти

#КонецЕсли
