
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//ВКМ_ДВИЖЕНИЯ ДЛЯ РЕГИСТРА НАКОПЛЕНИЯ - ВКМ_ВыполненныеКлиентуРаботы.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ОбслуживаниеКлиента.Договор.ВидДоговора КАК ДоговорВидДоговора,
	|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_ДействуетС КАК ДействуетС,
	|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_ДействуетПо КАК ДействуетПо,
	|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_СтомостьЧасаРаботы КАК СтомостьЧасаРаботы
	|ПОМЕСТИТЬ ВТ_ДанныеДоговора
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка
	|	И ВКМ_ОбслуживаниеКлиента.Договор.ВидДоговора В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ОписаниеРабот КАК ОписаниеРабот,
	|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ФактическиПотраченоЧасов КАК ФактическиПотраченоЧасов,
	|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ЧасыКОплатеКлиенту КАК ЧасыКОплатеКлиенту,
	|	ВТ_ДанныеДоговора.ДействуетС КАК ДействуетС,
	|	ВТ_ДанныеДоговора.ДействуетПо КАК ДействуетПо,
	|	ВТ_ДанныеДоговора.СтомостьЧасаРаботы КАК СтомостьЧасаРаботы
	|ИЗ
	|	ВТ_ДанныеДоговора КАК ВТ_ДанныеДоговора,
	|	Документ.ВКМ_ОбслуживаниеКлиента.ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ = РезультатЗапроса.Выгрузить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл	
		Если Дата >= Выборка.ДействуетС И Дата <= Выборка.ДействуетПо Тогда 	
			Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
			Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Клиент = Клиент;
			Движение.Договор = Договор;
			Движение.КоличествоЧасов = Выборка.ЧасыКОплатеКлиенту;
			Движение.СуммаКОплате = Выборка.ЧасыКОплатеКлиенту * Выборка.СтомостьЧасаРаботы;		
		Иначе 
			Отказ = Истина;  
			ОбщегоНазначения.СообщитьПользователю("Дата документа не соответствует периоду действия договора!");
			Возврат;	
		КонецЕсли;	
	КонецЦикла; 
	////////////////////////////////////////////////////////////////////////
	
	//ВКМ_ДВИЖЕНИЯ ДЛЯ РЕГИСТРА НАКОПЛЕНИЯ - ВКМ_ВыполненныеСотрудникомРаботы 	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ВКМ_УсловияОплатыСотрудников.Период) КАК Период,
		|	ВКМ_УсловияОплатыСотрудников.Сотрудник КАК Сотрудник,
		|	МАКСИМУМ(ВКМ_УсловияОплатыСотрудников.ПроцентОтРабот) КАК ПроцентОтРабот,
		|	МАКСИМУМ(ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_СтомостьЧасаРаботы) КАК СтомостьЧасаРаботы
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников КАК ВКМ_УсловияОплатыСотрудников,
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ВКМ_УсловияОплатыСотрудников.Сотрудник = &Сотрудник
		|	И ВКМ_УсловияОплатыСотрудников.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ВКМ_ОбслуживаниеКлиента.Договор = &Договор
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_УсловияОплатыСотрудников.Сотрудник";
				
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Сотрудник", Специалист);
	Запрос.УстановитьПараметр("Договор", Договор);

	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ = РезультатЗапроса.Выгрузить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;  
		ОбщегоНазначения.СообщитьПользователю("Для сотрудника не задан процент от работ в данном периоде");
		Возврат;
	КонецЕсли;
		
	Выборка = РезультатЗапроса.Выбрать();
			
	Выборка.Следующий();
			
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	
	Для Каждого Строка Из ВыполненныеРаботы Цикл
					
		Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сотрудник = Специалист;
		Движение.ЧасовКОплате = Строка.ЧасыКОплатеКлиенту;
		Движение.СуммаКОплате = Строка.ЧасыКОплатеКлиенту * Выборка.СтомостьЧасаРаботы * Выборка.ПроцентОтРабот / 100;	
				
	КонецЦикла;
	////////////////////////////////////////////////////////////////////////

КонецПроцедуры 

#КонецОбласти

#КонецЕсли
