
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//ДВИЖЕНИЯ ДЛЯ РЕГИСТРА НАКОПЛЕНИЯ - ВКМ_ВыполненныеКлиентуРаботы
	//Не сообразил как в пакетном запросе в условиях сравнить дату документа со значениями из временной таблицы
	//ДействуетС и ДействуетПо, поэтому пока сделал заплатку
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.ВКМ_Договор.ВидДоговора КАК ДоговорВидДоговора,
		|	ВКМ_ОбслуживаниеКлиента.ВКМ_Договор.ВКМ_ДействуетС КАК ДействуетС,
		|	ВКМ_ОбслуживаниеКлиента.ВКМ_Договор.ВКМ_ДействуетПо КАК ДействуетПо,
		|	ВКМ_ОбслуживаниеКлиента.ВКМ_Договор.ВКМ_СтомостьЧасаРаботы КАК СтомостьЧасаРаботы
		|ПОМЕСТИТЬ ВТ_ДанныеДоговора
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка
		|	И ВКМ_ОбслуживаниеКлиента.ВКМ_Договор.ВидДоговора В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиентаВКМ_ВыполненныеРаботы.ВКМ_ОписаниеРабот КАК ОписаниеРабот,
		|	ВКМ_ОбслуживаниеКлиентаВКМ_ВыполненныеРаботы.ВКМ_ФактическиПотраченоЧасов КАК ФактическиПотраченоЧасов,
		|	ВКМ_ОбслуживаниеКлиентаВКМ_ВыполненныеРаботы.ВКМ_ЧасыКОплатеКлиенту КАК ЧасыКОплатеКлиенту,
		|	ВТ_ДанныеДоговора.ДействуетС КАК ДействуетС,
		|	ВТ_ДанныеДоговора.ДействуетПо КАК ДействуетПо,
		|	ВТ_ДанныеДоговора.СтомостьЧасаРаботы КАК СтомостьЧасаРаботы
		|ИЗ
		|	ВТ_ДанныеДоговора КАК ВТ_ДанныеДоговора,
		|	Документ.ВКМ_ОбслуживаниеКлиента.ВКМ_ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентаВКМ_ВыполненныеРаботы
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиентаВКМ_ВыполненныеРаботы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ = РезультатЗапроса.Выгрузить();
	
	Выборка = РезультатЗапроса.Выбрать();
		
	Пока Выборка.Следующий() Цикл
		
		Если Дата >= Выборка.ДействуетС И Дата <= Выборка.ДействуетПо Тогда 
			
		Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Клиент = ВКМ_Клиент;
		Движение.Договор = ВКМ_Договор;
		Движение.КоличествоЧасов = Выборка.ЧасыКОплатеКлиенту;
		Движение.СуммаКОплате = Выборка.ЧасыКОплатеКлиенту * Выборка.СтомостьЧасаРаботы;	
			
		КонецЕсли;
		
	КонецЦикла;  
	
	
	//ДВИЖЕНИЯ ДЛЯ РЕГИСТРА НАКОПЛЕНИЯ - ВКМ_ВыполненныеСотрудникомРаботы 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ВКМ_УсловияОплатыСотрудников.Период) КАК Период,
		|	ВКМ_УсловияОплатыСотрудников.Сотрудник КАК Сотрудник,
		|	МАКСИМУМ(ВКМ_УсловияОплатыСотрудников.ПроцентОтРабот) КАК ПроцентОтРабот,
		|	МАКСИМУМ(ВКМ_ОбслуживаниеКлиента.ВКМ_Договор.ВКМ_СтомостьЧасаРаботы) КАК СтомостьЧасаРаботы
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников КАК ВКМ_УсловияОплатыСотрудников,
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ВКМ_УсловияОплатыСотрудников.Сотрудник = &Сотрудник
		|	И ВКМ_УсловияОплатыСотрудников.Период МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ВКМ_ОбслуживаниеКлиента.ВКМ_Договор = &Договор
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_УсловияОплатыСотрудников.Сотрудник";
		
			
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Сотрудник", ВКМ_Специалист);
	Запрос.УстановитьПараметр("Договор", ВКМ_Договор);

	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ = РезультатЗапроса.Выгрузить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;  
		ОбщегоНазначения.СообщитьПользователю("Для сотрудника не задан процент от работ в данном периоде");
		Возврат;
	КонецЕсли;
		
	Выборка = РезультатЗапроса.Выбрать();
			
	Выборка.Следующий();
			
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	
	Для Каждого Строка Из ВКМ_ВыполненныеРаботы Цикл
					
		Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сотрудник = ВКМ_Специалист;
		Движение.ЧасовКОплате = Строка.ВКМ_ЧасыКОплатеКлиенту;
		Движение.СуммаКОплате = Строка.ВКМ_ЧасыКОплатеКлиенту * Выборка.СтомостьЧасаРаботы * Выборка.ПроцентОтРабот / 100;	
				
	КонецЦикла;
	
КонецПроцедуры 

#КонецОбласти

#КонецЕсли
