
&НаСервере
Процедура ПолучитьТаблицуНаСервере()
	
    	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(РАЗНОСТЬДАТ(ВКМ_ОсновныеНачисления.ПериодДействияНачало, ВКМ_ОсновныеНачисления.ПериодДействияКонец, ДЕНЬ) + 1) КАК ОтгуленоДней,
		|	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТ_ОтгуленоДней
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
		|ГДЕ
		|	ВКМ_ОсновныеНачисления.ПериодРегистрации МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		|	И ВКМ_ОсновныеНачисления.ВидРасчета = &ВидРасчета
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОсновныеНачисления.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВКМ_ГрафикОтпусков.Сотрудник КАК Сотрудник,
		|	СУММА(ВКМ_ГрафикОтпусков.ВыходныхДней) КАК ВыходныхДней
		|ПОМЕСТИТЬ ВТ_ДнейПоПлану
		|ИЗ
		|	РегистрСведений.ВКМ_ГрафикОтпусков КАК ВКМ_ГрафикОтпусков
		|ГДЕ
		|	ВКМ_ГрафикОтпусков.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ГрафикОтпусков.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДнейПоПлану.Сотрудник КАК Сотрудник,
		|	ВТ_ДнейПоПлану.ВыходныхДней КАК ВыходныхДней,
		|	ВТ_ОтгуленоДней.ОтгуленоДней КАК ОтгуленоДней,
		|	ВТ_ДнейПоПлану.ВыходныхДней - ВТ_ОтгуленоДней.ОтгуленоДней КАК ОсталосьВыходных
		|ИЗ
		|	ВТ_ДнейПоПлану КАК ВТ_ДнейПоПлану
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОтгуленоДней КАК ВТ_ОтгуленоДней
		|		ПО ВТ_ДнейПоПлану.Сотрудник = ВТ_ОтгуленоДней.Сотрудник";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(Объект.Дата));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецГода(Объект.Дата));
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ = РезультатЗапроса.Выгрузить();
	
	Переменная = 1;
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(РАЗНОСТЬДАТ(ВКМ_ОсновныеНачисления.ПериодДействияНачало, ВКМ_ОсновныеНачисления.ПериодДействияКонец, ДЕНЬ) + 1) КАК ОтгуленоДней
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
		|ГДЕ
		|	ВКМ_ОсновныеНачисления.ПериодРегистрации МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		|	И ВКМ_ОсновныеНачисления.ВидРасчета = &ВидРасчета";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(Объект.Дата));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецГода(Объект.Дата));
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ1 = РезультатЗапроса.Выгрузить();
	
	Переменная = 1;
	
	
	
	
	
	
	
	
	
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ГрафикОтпусков.Сотрудник КАК Сотрудник,
		|	СУММА(ВКМ_ГрафикОтпусков.ВыходныхДней) КАК ВыходныхДней
		|ИЗ
		|	РегистрСведений.ВКМ_ГрафикОтпусков КАК ВКМ_ГрафикОтпусков
		|ГДЕ
		|	ВКМ_ГрафикОтпусков.Дата МЕЖДУ &НачалоПериода И &ОкончаниеПериода
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ГрафикОтпусков.Сотрудник";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(Объект.Дата));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецГода(Объект.Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ2 = РезультатЗапроса.Выгрузить();
	
	Переменная = 1;
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьТаблицу(Команда)
	ПолучитьТаблицуНаСервере();
КонецПроцедуры
